/**
  ******************************************************************************
  * @file    .c 
  * @author  TBD
  * @brief   
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 Rinlink.
  * All rights reserved.</center></h2>
  *
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>
#include <string.h>

#include "sensor.h"
/* Private typedef -----------------------------------------------------------*/
typedef union{
  int16_t i16bit[3];
  uint8_t u8bit[6];
} axis3bit16_t;

/* Private define ------------------------------------------------------------*/
/**  
 * @brief	阈值设置
 * @note	对于LIS2DS12 单位： 1/64 of FS
 */
#define WAKEUP_THRESHOLD	2
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* extern variables ---------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/* Public functions ---------------------------------------------------------*/
int Lis2ds12_Init(void);
int Lis2ds12_Get_Accel(Posture_StructDef *pos);


